book/git教程.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-08-26 六 09:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>《Git 教程》笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">《Git 教程》笔记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb525410">说明</a></li>
<li><a href="#org2b64c68">概述</a></li>
<li><a href="#org5803064">安装配置</a></li>
<li><a href="#orgdfe08f7">创建版本</a></li>
<li><a href="#org16378b5">时光穿梭</a></li>
<li><a href="#org0dd6e09">分支管理</a></li>
<li><a href="#org72c922a">标签管理</a></li>
<li><a href="#org26a79f3">建立远程仓库</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgb525410" class="outline-2">
<h2 id="orgb525410">说明</h2>
<div class="outline-text-2" id="text-orgb525410">
<p>
教程原文地址是 <a href="http://www.liaoxuefeng.com/wiki/0013739516305929606dd18361248578c67b8067c8c017b000">廖雪峰的官方网站-git教程</a>
</p>
</div>
</div>

<div id="outline-container-org2b64c68" class="outline-2">
<h2 id="org2b64c68">概述</h2>
<div class="outline-text-2" id="text-org2b64c68">
<p>
git 是分布式的版本管理系统。
</p>

<p>
与集中式相比，不需要时刻联网，也不需要中间服务器（可以有），本地就有完整的仓库。
</p>

<p>
另外，git 的分支管理也是一大亮点
</p>
</div>
</div>

<div id="outline-container-org5803064" class="outline-2">
<h2 id="org5803064">安装配置</h2>
<div class="outline-text-2" id="text-org5803064">
<p>
<i>ubuntu,debian 中的包之前命名为 git-core，因为有 gnu iterative tool 使用了 git 的名字</i>
</p>

<p>
配置使用命令 <code>git config</code> ，常见的配置有：
</p>

<dl class="org-dl">
<dt>user.name</dt><dd>用户名</dd>
<dt>user.email</dt><dd>email 地址</dd>
<dt>color.ui</dt><dd>是否启用颜色</dd>
<dt>alias.st</dt><dd>指定别名，如用 st 替代 status</dd>
<dt>core.quotepath</dt><dd>中文名问题</dd>
</dl>

<p>
另外可以在仓库下建立 <code>.gitignore</code> 文件，来忽略某些文件
</p>
</div>
</div>

<div id="outline-container-orgdfe08f7" class="outline-2">
<h2 id="orgdfe08f7">创建版本</h2>
<div class="outline-text-2" id="text-orgdfe08f7">
</div><div id="outline-container-org0aab687" class="outline-3">
<h3 id="org0aab687">本地仓库</h3>
<div class="outline-text-3" id="text-org0aab687">
<ol class="org-ol">
<li><code>git init</code></li>
<li><code>git add</code></li>
<li><code>git commit</code></li>
</ol>
</div>
</div>

<div id="outline-container-org23eeea2" class="outline-3">
<h3 id="org23eeea2">远程仓库</h3>
<div class="outline-text-3" id="text-org23eeea2">
<p>
<i>github 中可以通过公布 ssh pub key 来配置免密</i>
</p>

<dl class="org-dl">
<dt>添加远程仓库</dt><dd><code>git remote add origin &lt;url&gt;</code></dd>
<dt>推送到远程仓库</dt><dd><code>git push -u origin master</code></dd>
<dt>克隆仓库</dt><dd><code>git clone</code></dd>
</dl>
</div>

<div id="outline-container-org7525001" class="outline-4">
<h4 id="org7525001">注意</h4>
<div class="outline-text-4" id="text-org7525001">
<ul class="org-ul">
<li>克隆远端仓库时不会主动拉取除 master 之外的分支</li>
<li><code>git remote -v</code> 来查看远程仓库</li>
<li><code>git checkout -b dev origin/dev</code> 来获取远端的其它分支</li>
</ul>


<p>
远程仓库可以有多种协议，如 <code>http:</code>, <code>git:</code>, <code>ssh:</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org16378b5" class="outline-2">
<h2 id="org16378b5">时光穿梭</h2>
<div class="outline-text-2" id="text-org16378b5">
<p>
git 仓库历史版本与当前修改通过 diff, status 来查看
</p>
</div>

<div id="outline-container-orgf705af3" class="outline-3">
<h3 id="orgf705af3">版本回退</h3>
<div class="outline-text-3" id="text-orgf705af3">
<ul class="org-ul">
<li>通过 <code>git log --pretty oneline</code> 来查看历史提交</li>
<li><code>HEAD</code> 表示当前版本</li>
<li><code>HEAD^</code> 表示上一版本</li>
<li><code>HEAD~100</code> 表示前一百个版本</li>
<li>命令 <code>git reset --hard &lt;refspec&gt;</code> 来回退版本</li>
<li>通过 <code>git reflog</code> 来要查看历史命令，以找回 reset 后的提交</li>
</ul>
</div>
</div>


<div id="outline-container-org1265c78" class="outline-3">
<h3 id="org1265c78">工作区与暂存区</h3>
<div class="outline-text-3" id="text-org1265c78">
<ul class="org-ul">
<li>工作区指工作目录</li>
<li>版本库保存于 .git 目录
<ul class="org-ul">
<li>stage 为暂存器</li>
<li>master 主分支</li>
<li>HEAD 指针，指向当前分支</li>
</ul></li>
<li>add 命令添加到 stage 中</li>
<li>commit 刷 stage 到当前分支</li>
</ul>
</div>
</div>

<div id="outline-container-org1d9fedf" class="outline-3">
<h3 id="org1d9fedf">管理修改</h3>
<div class="outline-text-3" id="text-org1d9fedf">
<p>
git 跟踪的是修改，而非文件。实际上是对文件的 sha1sum 进行比较来跟踪修改。
</p>
</div>
</div>

<div id="outline-container-org217e8f7" class="outline-3">
<h3 id="org217e8f7">撤消修改</h3>
<div class="outline-text-3" id="text-org217e8f7">
<dl class="org-dl">
<dt><code>git checkout -- &lt;file&gt;</code></dt><dd>丢弃工作区修改</dd>
<dt><code>git reset HEAD &lt;file&gt;</code></dt><dd>unstage 修改</dd>
</dl>
</div>
</div>

<div id="outline-container-org9a1d7c4" class="outline-3">
<h3 id="org9a1d7c4">删除文件</h3>
<div class="outline-text-3" id="text-org9a1d7c4">
<p>
<code>git rm</code> 命令删除记录
</p>
</div>
</div>
</div>



<div id="outline-container-org0dd6e09" class="outline-2">
<h2 id="org0dd6e09">分支管理</h2>
<div class="outline-text-2" id="text-org0dd6e09">
<p>
git 按提交的父子关系形成一条时间轴，一条时间轴就是一个分支，默认为 master 分支。
</p>

<p>
HEAD 指向当前分支，可以有多个分支，分支之间可以在某个点分岔。
</p>

<dl class="org-dl">
<dt><code>git checkout -b dev</code></dt><dd>创建分支并切换</dd>
<dt><code>git branch</code></dt><dd>查看分支</dd>
<dt><code>git checkout master</code></dt><dd>切换回主分支</dd>
<dt><code>git merge dev</code></dt><dd>合并 dev 到当前分支</dd>
<dt><code>git branch -d dev</code></dt><dd>删除 dev 分支</dd>
</dl>
</div>

<div id="outline-container-org61007ad" class="outline-3">
<h3 id="org61007ad">合并</h3>
<div class="outline-text-3" id="text-org61007ad">
<ul class="org-ul">
<li>如果分支有前后继承关系，则为 fast forward</li>
<li>通过 &#x2013;no-ff 关闭快进模式，以便从日志中看出分支合并信息</li>
<li>通过 <code>git log --graph --pretty=oneline --abbrev-commit</code> 来查看分支图</li>
</ul>
</div>
</div>

<div id="outline-container-org179e5ff" class="outline-3">
<h3 id="org179e5ff">分支策略</h3>
<div class="outline-text-3" id="text-org179e5ff">
<ul class="org-ul">
<li>master 作为稳定内容，一般用于发布新版本</li>
<li>dev 用于开发</li>
<li>bug-xx 用于 bug 修复，合并后删除</li>
<li>feature 分支</li>
</ul>
</div>
</div>

<div id="outline-container-orgdc5e9db" class="outline-3">
<h3 id="orgdc5e9db">stash</h3>
<div class="outline-text-3" id="text-orgdc5e9db">
<ul class="org-ul">
<li>git stash 提供一个栈，缓存修改内容</li>
<li><code>git stash</code> 压栈， <code>git stash list</code> 查看</li>
<li><code>git apply</code> 配合 <code>git drop</code> ，等价于 <code>git pop</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org72c922a" class="outline-2">
<h2 id="org72c922a">标签管理</h2>
<div class="outline-text-2" id="text-org72c922a">
<p>
tag 对版本库提交生成指针，通过名称来标识提交
</p>

<dl class="org-dl">
<dt><code>git tag &lt;name&gt;</code></dt><dd>打标签</dd>
<dt><code>git tag</code></dt><dd>查看标签</dd>
<dt><code>git show &lt;tagname&gt;</code></dt><dd>查看详情</dd>
<dt><code>git tag -a v0.1 -m ""</code></dt><dd>带说明的标签</dd>
<dt><code>git push origin v1.0</code></dt><dd>推送指定标签</dd>
<dt><code>git push origin --tags</code></dt><dd>推送所有标签</dd>
<dt><code>git push origin :refs/tags/v0.9</code></dt><dd>删除远程仓库的标签</dd>
</dl>
</div>
</div>

<div id="outline-container-org26a79f3" class="outline-2">
<h2 id="org26a79f3">建立远程仓库</h2>
<div class="outline-text-2" id="text-org26a79f3">
<p>
基本的思路如下：
</p>

<ol class="org-ol">
<li>建立 git 用户，并配置其 shell 为 git-shell （禁止普通登录）</li>
<li>建立裸仓库 <code>git init --bare xxx</code></li>
<li>收集用户的 ssh public key，以无密操作</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2017-08-26 六 09:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
